# 1. Изучить метод  построения гистограммы. Изучили.
# 2. Построить гистограмму и эмпирическую функцию распределения непрерывных случайных величин.

# Случайные величины в нормальном распределении
x <- rnorm(100,0,1)
x <- rnorm(100)
hist(x, freq = FALSE)
curve(dnorm(x), add = TRUE)

# 3. Построить эмпирическую функцию распределения и столбиковую диаграмму для дискретной случайной величины.

# Dataset про погоду в Нью-Йорке
# Столбиковая диаграмма
hist(airquality$Temp, col = "red")

# Распределение вероятности
hist(airquality$Temp, freq = FALSE, col = "lightblue",
     ylab = "Плотность вероятности", xlab = "Температура")

# Кривая плотности вероятности + столбиковая диаграмма
lines(density(airquality$Temp))

# Кривая нормального распределения для сравнения
curve(dnorm(x, mean = mean(airquality$Temp, na.rm = TRUE),
             sd = sd(airquality$Temp, na.rm = TRUE)), add = TRUE, col = 'red')

# 4. Оценить долю наблюдений, лежащих в заданных границах с помощью гистограммы и эмпирической функции распределения.
